namespace MSEstatesAppLibrary.Services.MarketPlace;

public class MarketPlaceHelper
{
    public Dictionary<string, string> AdvertisementTypes = new()
    {
        { "Rent", "Rent" },
        { "Sell", "For Sale" }
    };

    public Dictionary<string, string> TranslateLocation = new()
    {
        { "Bang Tao", "ซอย บางเทา 7, เชิงทะเล, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Chalong", "วัดฉลอง, ฉลอง, ภูเก็ต, ภูเก็ต 83130, ประเทศไทย" },
        { "Cherng Thalay", "ซอย เชิงทะเล 1, เชิงทะเล, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Kalim", "บ้านกะหลิม, ถนน พระบารมี, ป่าตอง, กะทู้, ภูเก็ต 83150, ประเทศไทย" },
        { "Kamala", "ซอย ป่าตองทาวเวอร์, ป่าตอง, กะทู้, ภูเก็ต 83150, ประเทศไทย" },
        { "Kata", "ถนน กะตะ, กะรน, ภูเก็ต, ภูเก็ต 83100, ประเทศไทย" },
        { "Kathu", "ถนน กะทู้วิทยา, กะทู้, ภูเก็ต 83120, ประเทศไทย" },
        { "Khoa Keaw", "โรงเรียนมุสลิมวิทยาภูเก็ต, ถนน เทพกษัตรี, เกาะแก้ว, ภูเก็ต, ภูเก็ต 83000, ประเทศไทย" },
        { "Laguna", "ถนน ลากูน, เชิงทะเล, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Mai Khao", "ซอย ไม้ขาว 4, ไม้ขาว, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Phuket Town", "เทศบาลนครภูเก็ต, จังหวัดภูเก็ต 83000" },
        { "Nai Thon", "หาดในทอน, ทางหลวงชนบท ภก. 4018, สาคู, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Nai Han", "หาดในหาน, ราไวย์, ภูเก็ต, ภูเก็ต 83130, ประเทศไทย" },
        { "Nai Yang", "ในยาง 4, สาคู, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Pa Sak", "ซอย ป่าสัก 1, เชิงทะเล, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Pa Khlok", "หมู่ 2 ตำบลป่าคลอก อำเภอ ถลาง จังหวัดภูเก็ต, อำเภอถลาง, จังหวัดภูเก็ต" },
        { "Panwa", "แหลม พันวา, ถนน ศักดิเดชน์, วิชิต, ภูเก็ต, ภูเก็ต 83000, ประเทศไทย" },
        { "Patong", "ซอย นาใน 1, ป่าตอง, กะทู้, ภูเก็ต 83150, ประเทศไทย" },
        { "Rawai", "Rawai, Phuket 83130" },
        { "Sai Yuan", "ซอย ไสยวน 6, ราไวย์, ภูเก็ต, ภูเก็ต 83130, ประเทศไทย" },
        { "Thalang", "เทพกระษัตรี, ศรีสุนทร, ถลาง, ภูเก็ต 83110, ประเทศไทย" },
        { "Surin", "หาดสุรินทร์, ถนน ศรีสุนทร, เชิงทะเล, ถลาง, ภูเก็ต 83110, ประเทศไทย" }
    };
}